// ОБЩИЙ ПЛАН
// сделать получение карточек и данные моего профиля через Promise.all() ???

// доработка


// стили

// 8.  Обновление аватара пользователя (10 шаг)
// при наведении отображается, но немного непонятно, как задать нужные стили???


// проблема обновления после перезагрузки

// 7. Постановка и снятие лайка (9 шаг)
// лайк ставится, но это видно после перезагрузки страницы

// 6. Удаление карточки (8 шаг)
// удаляется, но только после обновления страницы исчезает


// Доделать
// Добавить отлов ошибок

